Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_tc.h
// Any mode
#define TC_CMR_TCCLKS_Pos           0            /**< \brief (TC_CMR) Clock Selection */
#define TC_CMR_TCCLKS_Msk           (0x7u << TC_CMR_TCCLKS_Pos)
#define TC_CMR_TCCLKS(value)        ((TC_CMR_TCCLKS_Msk & ((value) << TC_CMR_TCCLKS_Pos)))
#define   TC_CMR_TCCLKS_TIMER_CLOCK1 (0x0u <<  0) /**< \brief (TC_CMR) TIMER_CLOCK1 */
#define   TC_CMR_TCCLKS_TIMER_CLOCK2 (0x1u <<  0) /**< \brief (TC_CMR) TIMER_CLOCK2 */
#define   TC_CMR_TCCLKS_TIMER_CLOCK3 (0x2u <<  0) /**< \brief (TC_CMR) TIMER_CLOCK3 */
#define   TC_CMR_TCCLKS_TIMER_CLOCK4 (0x3u <<  0) /**< \brief (TC_CMR) TIMER_CLOCK4 */
#define   TC_CMR_TCCLKS_TIMER_CLOCK5 (0x4u <<  0) /**< \brief (TC_CMR) TIMER_CLOCK5 */
#define   TC_CMR_TCCLKS_XC0         (0x5u <<  0) /**< \brief (TC_CMR) XC0 */
#define   TC_CMR_TCCLKS_XC1         (0x6u <<  0) /**< \brief (TC_CMR) XC1 */
#define   TC_CMR_TCCLKS_XC2         (0x7u <<  0) /**< \brief (TC_CMR) XC2 */
#define TC_CMR_CLKI_Pos             3            /**< \brief (TC_CMR) Clock Invert */
#define TC_CMR_CLKI                 (0x1u << TC_CMR_CLKI_Pos)
#define   TC_CMR_CLKI_0             (0x0u <<  3) /**< \brief (TC_CMR) Counter is incremented on rising edge of the clock. */
#define   TC_CMR_CLKI_1             (0x1u <<  3) /**< \brief (TC_CMR) Counter is incremented on falling edge of the clock. */
#define TC_CMR_BURST_Pos            4            /**< \brief (TC_CMR) Burst Signal Selection */
#define TC_CMR_BURST_Msk            (0x3u << TC_CMR_BURST_Pos)
#define TC_CMR_BURST(value)         ((TC_CMR_BURST_Msk & ((value) << TC_CMR_BURST_Pos)))
#define   TC_CMR_BURST_NOT_GATED    (0x0u <<  4) /**< \brief (TC_CMR) The clock is not gated by an external signal. */
#define   TC_CMR_BURST_CLK_AND_XC0  (0x1u <<  4) /**< \brief (TC_CMR) XC0 is ANDed with the selected clock. */
#define   TC_CMR_BURST_CLK_AND_XC1  (0x2u <<  4) /**< \brief (TC_CMR) XC1 is ANDed with the selected clock. */
#define   TC_CMR_BURST_CLK_AND_XC2  (0x3u <<  4) /**< \brief (TC_CMR) XC2 is ANDed with the selected clock. */
#define TC_CMR_LDBSTOP_Pos          6            /**< \brief (TC_CMR) Counter Clock Stopped with RB Loading */
#define TC_CMR_LDBSTOP              (0x1u << TC_CMR_LDBSTOP_Pos)
#define   TC_CMR_LDBSTOP_0          (0x0u <<  6) /**< \brief (TC_CMR) Counter clock is not stopped when RB loading occurs. */
#define   TC_CMR_LDBSTOP_1          (0x1u <<  6) /**< \brief (TC_CMR) Counter clock is stopped when RB loading occurs. */
#define TC_CMR_CPCSTOP_Pos          6            /**< \brief (TC_CMR) Counter Clock Stopped with RC Compare */
#define TC_CMR_CPCSTOP              (0x1u << TC_CMR_CPCSTOP_Pos)
#define   TC_CMR_CPCSTOP_0          (0x0u <<  6) /**< \brief (TC_CMR) Counter clock is not stopped when counter reaches RC. */
#define   TC_CMR_CPCSTOP_1          (0x1u <<  6) /**< \brief (TC_CMR) Counter clock is stopped when counter reaches RC. */
#define TC_CMR_LDBDIS_Pos           7            /**< \brief (TC_CMR) Counter Clock Disable with RB Loading */
#define TC_CMR_LDBDIS               (0x1u << TC_CMR_LDBDIS_Pos)
#define   TC_CMR_LDBDIS_0           (0x0u <<  7) /**< \brief (TC_CMR) Counter clock is not disabled when RB loading occurs. */
#define   TC_CMR_LDBDIS_1           (0x1u <<  7) /**< \brief (TC_CMR) Counter clock is disabled when RB loading occurs. */
#define TC_CMR_CPCDIS_Pos           7            /**< \brief (TC_CMR) Counter Clock Disable with RC Compare */
#define TC_CMR_CPCDIS               (0x1u << TC_CMR_CPCDIS_Pos)
#define   TC_CMR_CPCDIS_0           (0x0u <<  7) /**< \brief (TC_CMR) Counter clock is not disabled when counter reaches RC. */
#define   TC_CMR_CPCDIS_1           (0x1u <<  7) /**< \brief (TC_CMR) Counter clock is disabled when counter reaches RC. */
#define TC_CMR_ETRGEDG_Pos          8            /**< \brief (TC_CMR) External Trigger Edge Selection */
#define TC_CMR_ETRGEDG_Msk          (0x3u << TC_CMR_ETRGEDG_Pos)
#define TC_CMR_ETRGEDG(value)       ((TC_CMR_ETRGEDG_Msk & ((value) << TC_CMR_ETRGEDG_Pos)))
#define   TC_CMR_ETRGEDG_NO_EDGE    (0x0u <<  8) /**< \brief (TC_CMR) none */
#define   TC_CMR_ETRGEDG_POS_EDGE   (0x1u <<  8) /**< \brief (TC_CMR) rising edge */
#define   TC_CMR_ETRGEDG_NEG_EDGE   (0x2u <<  8) /**< \brief (TC_CMR) falling edge */
#define   TC_CMR_ETRGEDG_BOTH_EDGES (0x3u <<  8) /**< \brief (TC_CMR) each edge */
#define TC_CMR_EEVTEDG_Pos          8            /**< \brief (TC_CMR) External Event Edge Selection */
#define TC_CMR_EEVTEDG_Msk          (0x3u << TC_CMR_EEVTEDG_Pos)
#define TC_CMR_EEVTEDG(value)       ((TC_CMR_EEVTEDG_Msk & ((value) << TC_CMR_EEVTEDG_Pos)))
#define   TC_CMR_EEVTEDG_NO_EDGE    (0x0u <<  8) /**< \brief (TC_CMR) none */
#define   TC_CMR_EEVTEDG_POS_EDGE   (0x1u <<  8) /**< \brief (TC_CMR) rising edge */
#define   TC_CMR_EEVTEDG_NEG_EDGE   (0x2u <<  8) /**< \brief (TC_CMR) falling edge */
#define   TC_CMR_EEVTEDG_BOTH_EDGES (0x3u <<  8) /**< \brief (TC_CMR) each edge */
#define TC_CMR_ABETRG_Pos           10           /**< \brief (TC_CMR) TIOA or TIOB External Trigger Selection */
#define TC_CMR_ABETRG               (0x1u << TC_CMR_ABETRG_Pos)
#define   TC_CMR_ABETRG_0           (0x0u << 10) /**< \brief (TC_CMR) TIOB is used as an external trigger. */
#define   TC_CMR_ABETRG_1           (0x1u << 10) /**< \brief (TC_CMR) TIOA is used as an external trigger. */
#define TC_CMR_EEVT_Pos             10           /**< \brief (TC_CMR) External Event Selection */
#define TC_CMR_EEVT_Msk             (0x3u << TC_CMR_EEVT_Pos)
#define TC_CMR_EEVT(value)          ((TC_CMR_EEVT_Msk & ((value) << TC_CMR_EEVT_Pos)))
#define   TC_CMR_EEVT_TIOB_INPUT    (0x0u << 10) /**< \brief (TC_CMR) TIOB input. If TIOB is chosen as the external event signal, it is configured as an input and no longer generates waveforms. */
#define   TC_CMR_EEVT_XC0_OUTPUT    (0x1u << 10) /**< \brief (TC_CMR) XC0 output */
#define   TC_CMR_EEVT_XC1_OUTPUT    (0x2u << 10) /**< \brief (TC_CMR) XC1 output */
#define   TC_CMR_EEVT_XC2_OUTPUT    (0x3u << 10) /**< \brief (TC_CMR) XC2 output */
#define TC_CMR_ENETRG_Pos           12           /**< \brief (TC_CMR) External Event Trigger Enable */
#define TC_CMR_ENETRG               (0x1u << TC_CMR_ENETRG_Pos)
#define   TC_CMR_ENETRG_0           (0x0u << 12) /**< \brief (TC_CMR) The external event has no effect on the counter and its clock. In this case, the selected external event only controls the TIOA output. */
#define   TC_CMR_ENETRG_1           (0x1u << 12) /**< \brief (TC_CMR) The external event resets the counter and starts the counter clock. */
#define TC_CMR_WAVSEL_Pos           13           /**< \brief (TC_CMR) Waveform Selection */
#define TC_CMR_WAVSEL_Msk           (0x3u << TC_CMR_WAVSEL_Pos)
#define TC_CMR_WAVSEL(value)        ((TC_CMR_WAVSEL_Msk & ((value) << TC_CMR_WAVSEL_Pos)))
#define   TC_CMR_WAVSEL_UP_NO_AUTO  (0x0u << 13) /**< \brief (TC_CMR) UP mode without automatic trigger on RC Compare */
#define   TC_CMR_WAVSEL_UPDOWN_NO_AUTO (0x1u << 13) /**< \brief (TC_CMR) UPDOWN mode without automatic trigger on RC Compare */
#define   TC_CMR_WAVSEL_UP_AUTO     (0x2u << 13) /**< \brief (TC_CMR) UP mode with automatic trigger on RC Compare */
#define   TC_CMR_WAVSEL_UPDOWN_AUTO (0x3u << 13) /**< \brief (TC_CMR) UPDOWN mode with automatic trigger on RC Compare */
#define TC_CMR_CPCTRG_Pos           14           /**< \brief (TC_CMR) RC Compare Trigger Enable */
#define TC_CMR_CPCTRG               (0x1u << TC_CMR_CPCTRG_Pos)
#define   TC_CMR_CPCTRG_0           (0x0u << 14) /**< \brief (TC_CMR) RC Compare has no effect on the counter and its clock. */
#define   TC_CMR_CPCTRG_1           (0x1u << 14) /**< \brief (TC_CMR) RC Compare resets the counter and starts the counter clock. */
#define TC_CMR_WAVE_Pos             15           /**< \brief (TC_CMR) Wave */
#define TC_CMR_WAVE                 (0x1u << TC_CMR_WAVE_Pos)
#define   TC_CMR_WAVE_0             (0x0u << 15) /**< \brief (TC_CMR) Capture Mode is enabled. */
#define   TC_CMR_WAVE_1             (0x1u << 15) /**< \brief (TC_CMR) Capture Mode is disabled (Waveform Mode is enabled). */
#define TC_CMR_LDRA_Pos             16           /**< \brief (TC_CMR) RA Loading Selection */
#define TC_CMR_LDRA_Msk             (0x3u << TC_CMR_LDRA_Pos)
#define TC_CMR_LDRA(value)          ((TC_CMR_LDRA_Msk & ((value) << TC_CMR_LDRA_Pos)))
#define   TC_CMR_LDRA_NO_EDGE       (0x0u << 16) /**< \brief (TC_CMR) none */
#define   TC_CMR_LDRA_POS_EDGE_TIOA (0x1u << 16) /**< \brief (TC_CMR) rising edge of TIOA */
#define   TC_CMR_LDRA_NEG_EDGE_TIOA (0x2u << 16) /**< \brief (TC_CMR) falling edge of TIOA */
#define   TC_CMR_LDRA_BOTH_EDGES_TIOA (0x3u << 16) /**< \brief (TC_CMR) each edge of TIOA */
#define TC_CMR_ACPA_Pos             16           /**< \brief (TC_CMR) RA Compare Effect on TIOA */
#define TC_CMR_ACPA_Msk             (0x3u << TC_CMR_ACPA_Pos)
#define TC_CMR_ACPA(value)          ((TC_CMR_ACPA_Msk & ((value) << TC_CMR_ACPA_Pos)))
#define   TC_CMR_ACPA_NONE          (0x0u << 16) /**< \brief (TC_CMR) none */
#define   TC_CMR_ACPA_SET           (0x1u << 16) /**< \brief (TC_CMR) set */
#define   TC_CMR_ACPA_CLEAR         (0x2u << 16) /**< \brief (TC_CMR) clear */
#define   TC_CMR_ACPA_TOGGLE        (0x3u << 16) /**< \brief (TC_CMR) toggle */
#define TC_CMR_LDRB_Pos             18           /**< \brief (TC_CMR) RB Loading Selection */
#define TC_CMR_LDRB_Msk             (0x3u << TC_CMR_LDRB_Pos)
#define TC_CMR_LDRB(value)          ((TC_CMR_LDRB_Msk & ((value) << TC_CMR_LDRB_Pos)))
#define   TC_CMR_LDRB_NO_EDGE       (0x0u << 18) /**< \brief (TC_CMR) none */
#define   TC_CMR_LDRB_POS_EDGE_TIOA (0x1u << 18) /**< \brief (TC_CMR) rising edge of TIOA */
#define   TC_CMR_LDRB_NEG_EDGE_TIOA (0x2u << 18) /**< \brief (TC_CMR) falling edge of TIOA */
#define   TC_CMR_LDRB_BOTH_EDGES_TIOA (0x3u << 18) /**< \brief (TC_CMR) each edge of TIOA */
#define TC_CMR_ACPC_Pos             18           /**< \brief (TC_CMR) RC Compare Effect on TIOA */
#define TC_CMR_ACPC_Msk             (0x3u << TC_CMR_ACPC_Pos)
#define TC_CMR_ACPC(value)          ((TC_CMR_ACPC_Msk & ((value) << TC_CMR_ACPC_Pos)))
#define   TC_CMR_ACPC_NONE          (0x0u << 18) /**< \brief (TC_CMR) none */
#define   TC_CMR_ACPC_SET           (0x1u << 18) /**< \brief (TC_CMR) set */
#define   TC_CMR_ACPC_CLEAR         (0x2u << 18) /**< \brief (TC_CMR) clear */
#define   TC_CMR_ACPC_TOGGLE        (0x3u << 18) /**< \brief (TC_CMR) toggle */
#define TC_CMR_AEEVT_Pos            20           /**< \brief (TC_CMR) External Event Effect on TIOA */
#define TC_CMR_AEEVT_Msk            (0x3u << TC_CMR_AEEVT_Pos)
#define TC_CMR_AEEVT(value)         ((TC_CMR_AEEVT_Msk & ((value) << TC_CMR_AEEVT_Pos)))
#define   TC_CMR_AEEVT_NONE         (0x0u << 20) /**< \brief (TC_CMR) none */
#define   TC_CMR_AEEVT_SET          (0x1u << 20) /**< \brief (TC_CMR) set */
#define   TC_CMR_AEEVT_CLEAR        (0x2u << 20) /**< \brief (TC_CMR) clear */
#define   TC_CMR_AEEVT_TOGGLE       (0x3u << 20) /**< \brief (TC_CMR) toggle */
#define TC_CMR_ASWTRG_Pos           22           /**< \brief (TC_CMR) Software Trigger Effect on TIOA */
#define TC_CMR_ASWTRG_Msk           (0x3u << TC_CMR_ASWTRG_Pos)
#define TC_CMR_ASWTRG(value)        ((TC_CMR_ASWTRG_Msk & ((value) << TC_CMR_ASWTRG_Pos)))
#define   TC_CMR_ASWTRG_NONE        (0x0u << 22) /**< \brief (TC_CMR) none */
#define   TC_CMR_ASWTRG_SET         (0x1u << 22) /**< \brief (TC_CMR) set */
#define   TC_CMR_ASWTRG_CLEAR       (0x2u << 22) /**< \brief (TC_CMR) clear */
#define   TC_CMR_ASWTRG_TOGGLE      (0x3u << 22) /**< \brief (TC_CMR) toggle */
#define TC_CMR_BCPB_Pos             24           /**< \brief (TC_CMR) RB Compare Effect on TIOB */
#define TC_CMR_BCPB_Msk             (0x3u << TC_CMR_BCPB_Pos)
#define TC_CMR_BCPB(value)          ((TC_CMR_BCPB_Msk & ((value) << TC_CMR_BCPB_Pos)))
#define   TC_CMR_BCPB_NONE          (0x0u << 24) /**< \brief (TC_CMR) none */
#define   TC_CMR_BCPB_SET           (0x1u << 24) /**< \brief (TC_CMR) set */
#define   TC_CMR_BCPB_CLEAR         (0x2u << 24) /**< \brief (TC_CMR) clear */
#define   TC_CMR_BCPB_TOGGLE        (0x3u << 24) /**< \brief (TC_CMR) toggle */
#define TC_CMR_BCPC_Pos             26           /**< \brief (TC_CMR) RC Compare Effect on TIOB */
#define TC_CMR_BCPC_Msk             (0x3u << TC_CMR_BCPC_Pos)
#define TC_CMR_BCPC(value)          ((TC_CMR_BCPC_Msk & ((value) << TC_CMR_BCPC_Pos)))
#define   TC_CMR_BCPC_NONE          (0x0u << 26) /**< \brief (TC_CMR) none */
#define   TC_CMR_BCPC_SET           (0x1u << 26) /**< \brief (TC_CMR) set */
#define   TC_CMR_BCPC_CLEAR         (0x2u << 26) /**< \brief (TC_CMR) clear */
#define   TC_CMR_BCPC_TOGGLE        (0x3u << 26) /**< \brief (TC_CMR) toggle */
#define TC_CMR_BEEVT_Pos            28           /**< \brief (TC_CMR) External Event Effect on TIOB */
#define TC_CMR_BEEVT_Msk            (0x3u << TC_CMR_BEEVT_Pos)
#define TC_CMR_BEEVT(value)         ((TC_CMR_BEEVT_Msk & ((value) << TC_CMR_BEEVT_Pos)))
#define   TC_CMR_BEEVT_NONE         (0x0u << 28) /**< \brief (TC_CMR) none */
#define   TC_CMR_BEEVT_SET          (0x1u << 28) /**< \brief (TC_CMR) set */
#define   TC_CMR_BEEVT_CLEAR        (0x2u << 28) /**< \brief (TC_CMR) clear */
#define   TC_CMR_BEEVT_TOGGLE       (0x3u << 28) /**< \brief (TC_CMR) toggle */
#define TC_CMR_BSWTRG_Pos           30           /**< \brief (TC_CMR) Software Trigger Effect on TIOB */
#define TC_CMR_BSWTRG_Msk           (0x3u << TC_CMR_BSWTRG_Pos)
#define TC_CMR_BSWTRG(value)        ((TC_CMR_BSWTRG_Msk & ((value) << TC_CMR_BSWTRG_Pos)))
#define   TC_CMR_BSWTRG_NONE        (0x0u << 30) /**< \brief (TC_CMR) none */
#define   TC_CMR_BSWTRG_SET         (0x1u << 30) /**< \brief (TC_CMR) set */
#define   TC_CMR_BSWTRG_CLEAR       (0x2u << 30) /**< \brief (TC_CMR) clear */
#define   TC_CMR_BSWTRG_TOGGLE      (0x3u << 30) /**< \brief (TC_CMR) toggle */
#define TC_CMR_MASK                 0xFFFFFFFFu  /**< \brief (TC_CMR) MASK Register */

